examples/porousHeatTransferFoam/energyRelease/constViscosity/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T 300
);

regions
(
    // Set patch values (using ==)
    boxToFace
    {
        box (2.5 -1000 -2.5) (7.5 1e-5 17.5);
	//	box (2.5 -1000 2.5) (7.5 1000 7.5);
	//	box (-2.5 -1000 -2.5) (17.5 1e5 17.5);

        fieldValues
        (
            volScalarFieldValue T 1000
        );
    }
);

// ************************************************************************* //
